ruby_on_rails/members-only/app/controllers/application_controller.rb

	def current_user
		if token = decode_cookie( :remember_token )
			@user ||= User.find_by remember_digest: User.digest( token )
---
SELECT  "users".* FROM "users" WHERE "users"."remember_digest" = ? LIMIT ?  [["remember_digest", "5e1199d75ba4fe92c9f285799a7adb483f35249f"], ["LIMIT", 1]]