ruby_on_rails/members-only/app/controllers/posts_controller.rb

	def create
		@post = Post.new(post_params)
		@post.user_id = current_user.id
		if @post.save
---
INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "last post"], ["body", "goodbye"], ["created_at", "2019-03-04 07:19:34.775833"], ["updated_at", "2019-03-04 07:19:34.775833"]]