ruby_on_rails/members-only/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "brendaneus@gmail.com"], ["LIMIT", 1]]
---
	def create
		@user = User.find_by( email: params[:session][:email] )