ruby_on_rails/private-events/app/views/invitations/new.html.erb

	<%= f.label :invitee_id %>
	<%= f.select :invitee_id, User.all.collect { |user| [user.name, user.id] } %>
---
SELECT "users".* FROM "users"