live_preview/app/controllers/courses_controller.rb

	def index
		@courses = Course.visible.includes(:projects)
---
SELECT "courses".* FROM "courses" WHERE "courses"."visible" = ?  [["visible", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."course_id" = ?  [["course_id", 6]]

	def show
		@course = Course.includes(:projects).find_by_slug(params[:slug])
---
SELECT "courses".* FROM "courses" WHERE "courses"."slug" = ? LIMIT ?  [["slug", "javascript"], ["LIMIT", 1]]