live_preview/app/controllers/projects_controller.rb

	def show
		@course = Course.find_by_slug(params[:course_slug])
		@project = @course.projects.find_by_slug(params[:slug])
---
SELECT "courses".* FROM "courses" WHERE "courses"."slug" = ? LIMIT ?  [["slug", "javascript"], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."course_id" = ? AND "projects"."slug" = ? LIMIT ?  [["course_id", 6], ["slug", "react-library"], ["LIMIT", 1]]