ruby_on_rails/members-only/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test01@example.com"], ["LIMIT", 1]]
---
	def remember
		self.remember_token = User.new_token

		# Upon creation of a new object...
		unless User.find_by email: self.email