ruby_on_rails/re-former/app/controllers/users_controller.rb

	def update
		@user = User.find params[:id]

		if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "email" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "test_again"], ["email", "test@example.com"], ["password", "password"], ["updated_at", "2019-02-14 03:24:16.399492"], ["id", 1]]