ruby_on_rails/private-events/app/models/invitation.rb

		def invitee_is_not_attending
			if ( event.attendees.include? invitee )
---
SELECT "invitations".* FROM "invitations" WHERE "invitations"."invitee_id" = ?  [["invitee_id", 2]]

		def invitee_is_not_invited
			if ( invitee.received_invitations.collect{ |invitation| invitation.event }.include? event )
---
SELECT "invitations".* FROM "invitations" WHERE "invitations"."invitee_id" = ?  [["invitee_id", 2]]