ruby_on_rails/private-events/app/controllers/attendances_controller.rb

	def create
		event = Event.find(params[:event_id])
		user = User.find(params[:user_id])
		if event.attendees.include? user
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

	def destroy
		event = Event.find(params[:event_id])
		user = User.find(params[:user_id])
		if !event.attendees.include? user
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

		def require_authenticate_or_creator
			event = Event.find( params[:event_id] )
			unless ( current_user == User.find( params[:user_id] ) ) || ( hosting? event )
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]