ruby_on_rails/private-events/app/controllers/events_controller.rb

	def index
		@events = Event.all
---
SELECT "events".* FROM "events" WHERE (date > '2019-03-18 04:17:43.322446')

	def create
		@event = current_user.created_events.build(event_params)
		if @event.save
---
INSERT INTO "events" ("name", "description", "date", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "the thing"], ["description", "a fling"], ["date", "2019-03-20"], ["created_at", "2019-03-19 04:23:05.341515"], ["updated_at", "2019-03-19 04:23:05.341515"], ["creator_id", 2]]
INSERT INTO "events" ("name", "description", "date", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "The Big One"], ["description", "akuna ma tata"], ["date", "2019-03-28"], ["created_at", "2019-03-19 07:50:03.405073"], ["updated_at", "2019-03-19 07:50:03.405073"], ["creator_id", 2]]