ruby_on_rails/private-events/app/controllers/invitations_controller.rb

	def show
		@invitation = Invitation.find( params[:id] )
---
SELECT  "invitations".* FROM "invitations" WHERE "invitations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def new
		@event = Event.find( params[:event_id] )
		@user_choices = User.where( 'id NOT IN ?', @event.attendees.collect { |attendee| attendee.id } )
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def create
		@event = Event.find( params[:event_id] )
		@invitation = @event.invitations.build( invitation_params )
		@invitation.inviter = current_user
		if @invitation.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "invitations" ("event_id", "inviter_id", "invitee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["event_id", 2], ["inviter_id", 2], ["invitee_id", 2], ["created_at", "2019-03-20 07:46:15.234154"], ["updated_at", "2019-03-20 07:46:15.234154"]]

	def destroy
		@invitation = Invitation.find( params[:id] )
		@invitation.destroy
---
SELECT  "invitations".* FROM "invitations" WHERE "invitations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "invitations" WHERE "invitations"."id" = ?  [["id", 2]]

		def require_creator
			event = Event.find( params[:event_id] )
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

		def require_invitee_or_inviter_or_creator
			invitation = Invitation.find(params[:id] )
---
SELECT  "invitations".* FROM "invitations" WHERE "invitations"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]