ruby_on_rails/private-events/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "abc"], ["LIMIT", 1]]
---
	def create
		session_name = params[:session][:name]
		if @user = User.find_by_name( session_name )