ruby_on_rails/private-events/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "abc"], ["created_at", "2019-03-15 05:48:05.973732"], ["updated_at", "2019-03-15 05:48:05.973732"]]
---
  def create
  	@user = User.new(user_params)
  	if @user.save