ruby_on_rails/private-events/app/helpers/application_helper.rb

	def current_user
		if session_id = session[:user_id]
			@user ||= User.find( session_id )
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]